tests/wrkTest.txt
Running 10s test @ http://localhost:8080/test.txt
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.55ms   20.77ms 909.65ms   99.48%
    Req/Sec    91.62k    13.64k  135.67k    60.53%
  3620620 requests in 10.09s, 1.74GB read
Requests/sec: 358980.12
Transfer/sec:    176.31MB

Running 10s test @ http://localhost:8080/random
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.07ms    3.98ms  32.65ms   70.35%
    Req/Sec   114.50k    20.83k  151.51k    64.34%
  4507142 requests in 10.05s, 463.79MB read
Requests/sec: 448329.22
Transfer/sec:     46.13MB