tests/wrkTest.txt
Running 10s test @ http://localhost:8080/random
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.85ms    4.75ms  34.98ms   64.58%
    Req/Sec    90.32k    16.70k  135.72k    59.52%
  3568740 requests in 10.06s, 367.23MB read
Requests/sec: 354677.27
Transfer/sec:     36.50MB

Running 10s test @ http://localhost:8080/test.txt
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.30ms    9.18ms  91.12ms   69.91%
    Req/Sec    54.84k     7.68k   85.00k    72.82%
  2173955 requests in 10.10s, 1.04GB read
Requests/sec: 215242.77
Transfer/sec:    105.71MB